In [1]:
import sqlite3
import numpy as np
import pandas as pd

In [11]:
#crear conector para DB local
conn=sqlite3.connect("thebridge.db")

In [12]:
#crear comando/cursor
cursor = conn.cursor()

In [13]:
#crear tabla
cursor.execute(
    
'''

CREATE TABLE IF NOT EXISTS Estudiantes (

 Nombre VARCHAR(50) NULL /*admite nulos*/
 ,Edad TINYINT NOT NULL /*no admite nulos*/
 ,email VARCHAR(50) NULL
 ,Ciudad VARCHAR(100) NULL DEFAULT "Madrid"
 ,Created_On DATETIME
 
);

'''

)

# guardamos cambios con  comando commit

conn.commit()

#cerrar conexión

conn.close()

In [24]:
conn=sqlite3.connect("thebridge.db")
cursor=conn.cursor()

cursor.execute(
     ''' 
     INSERT INTO Estudiantes VALUES
     ("Alberto", 42, "a@gmail.com", "Madrid", "2023-05-28 10:00:00");
    '''
)

conn.commit()
conn.close()

In [20]:
conn=sqlite3.connect("thebridge.db")
cursor=conn.cursor()
cursor.execute(
    '''
        SELECT * 
        FROM Estudiantes
        ORDER BY Created_On DESC
    '''
)

# mostrar la info consultada

print(cursor.fetchall()[0][2])

j@gmail.com

In [21]:
q='''
        SELECT * 
        FROM Estudiantes
        ORDER BY Created_On DESC
    '''

db=pd.read_sql(sql=q, con=conn)

In [22]:
db

  Nombre  Edad        email  Ciudad           Created_On
0   Jose    42  j@gmail.com  Madrid  2023-05-27 21:00:00
1   Jose    42  j@gmail.com  Madrid  2023-05-27 21:00:00
2   Jose    42  j@gmail.com  Madrid  2023-05-27 21:00:00

## Gestión Tablas Relacionales

### PRIMARY KEY solo admite valores únicos

In [36]:
conexion=sqlite3.connect('usuarios.db')
cursor=conexion.cursor()

cursor.execute(
    ''' 
        CREATE TABLE IF NOT EXISTS clientes (
        dni VARCHAR(9) PRIMARY KEY, /*no tendra duplicados*/
        nombre VARCHAR(100), 
        edad INTEGER,
        email VARCHAR(100)
 )'''
)

* lista de usuarios

In [32]:
usuarios = [('11111111A', 'Hector', 27, 'hector@ejemplo.com'),
            ('22222222B', 'Mario', 51, 'mario@ejemplo.com'),
            ('33333333C', 'Mercedes', 38, 'mercedes@ejemplo.com'),
            ('44444444D', 'Juan', 19, 'juan@ejemplo.com')]

cursor.executemany("INSERT INTO clientes VALUES (?,?,?,?)", usuarios)

conexion.commit()
conexion.close()

*  si intentamos añadir misma primary key en otro registro, salta IntegrityError

In [34]:
conexion=sqlite3.connect('usuarios.db')
cursor=conexion.cursor()

s='''
        SELECT * 
        FROM clientes
    '''

db=pd.read_sql(sql=s, con=conexion)

In [37]:
conexion = sqlite3.connect('productos.db')

cursor = conexion.cursor()

# Las cláusulas not null indican que no puede ser campos vacíos
cursor.execute('''CREATE TABLE IF NOT EXISTS productos (
                    id INTEGER PRIMARY KEY AUTOINCREMENT, 
                    nombre VARCHAR(100) NOT NULL, 
                    marca VARCHAR(50) NOT NULL, 
                    precio FLOAT NOT NULL)''')
conexion.commit()
conexion.close()

In [38]:
import sqlite3

conexion = sqlite3.connect('productos.db')

cursor = conexion.cursor()

productos = [('Teclado', 'Logitech', 19.95),
            ('Pantalla 19"','LG', 89.95),
            ('Altavoces 2.1','LG', 24.95),]

cursor.executemany("INSERT INTO productos VALUES (null,?,?,?)", productos)

conexion.commit()
conexion.close()

In [39]:
import sqlite3

conexion = sqlite3.connect('usuarios_autoincremental.db')

cursor = conexion.cursor()

# Creamos un campo dni como clave primaria
cursor.execute('''CREATE TABLE IF NOT EXISTS usuarios (
                    id INTEGER PRIMARY KEY,
                    dni VARCHAR(9) UNIQUE,
                    nombre VARCHAR(100), 
                    edad INTEGER(3),
                    email VARCHAR(100))''')

usuarios = [('11111111A', 'Hector', 27, 'hector@ejemplo.com'),
            ('22222222B', 'Mario', 51, 'mario@ejemplo.com'),
            ('33333333C', 'Mercedes', 38, 'mercedes@ejemplo.com'),
            ('44444444D', 'Juan', 19, 'juan@ejemplo.com')]

cursor.executemany("INSERT INTO usuarios VALUES (null, ?,?,?,?)", usuarios)

conexion.commit()
conexion.close()

In [40]:
import sqlite3

conexion = sqlite3.connect('usuarios_autoincremental.db')
cursor = conexion.cursor()

# Recuperamos los registros de la tabla de usuarios
cursor.execute("SELECT * FROM usuarios")

# Recorremos todos los registros con fetchall
# y los volcamos en una lista de usuarios
usuarios = cursor.fetchall()

# Ahora podemos recorrer todos los usuarios
for usuario in usuarios:
    print(usuario)

conexion.close()

(1, '11111111A', 'Hector', 27, 'hector@ejemplo.com')
(2, '22222222B', 'Mario', 51, 'mario@ejemplo.com')
(3, '33333333C', 'Mercedes', 38, 'mercedes@ejemplo.com')
(4, '44444444D', 'Juan', 19, 'juan@ejemplo.com')

In [52]:
conexion = sqlite3.connect('usuarios_autoincremental.db')
cursor = conexion.cursor()
q=''' 
SELECT * FROM usuarios
'''
df=pd.read_sql(sql=q, con=conexion)
conexion.close()
df

   id        dni    nombre  edad                 email
0   1  11111111A    Hector    27    hector@ejemplo.com
1   2  22222222B     Mario    51     mario@ejemplo.com
2   3  33333333C  Mercedes    38  mercedes@ejemplo.com
3   4  44444444D      Juan    19      juan@ejemplo.com

In [57]:
conexion=sqlite3.connect('usuarios_autoincremental.db')
cursor = conexion.cursor()
q=''' 
SELECT * FROM usuarios WHERE edad >19
'''

df=pd.read_sql(sql=q,con=conexion)
df

   id        dni    nombre  edad                 email
0   1  11111111A    Hector    27    hector@ejemplo.com
1   2  22222222B     Mario    51     mario@ejemplo.com
2   3  33333333C  Mercedes    38  mercedes@ejemplo.com

In [58]:
import sqlite3

conexion = sqlite3.connect('usuarios_autoincremental.db')
cursor = conexion.cursor()

# Recuperamos los registros de la tabla de usuarios
cursor.execute("SELECT * FROM usuarios")

# Recorremos todos los registros con fetchall
# y los volcamos en una lista de usuarios
usuarios = cursor.fetchall()

# Ahora podemos recorrer todos los usuarios
for usuario in usuarios:
    print(usuario)

conexion.close()

(1, '11111111A', 'Hector', 27, 'hector@ejemplo.com')
(2, '22222222B', 'Mario', 51, 'mario@ejemplo.com')
(3, '33333333C', 'Mercedes', 38, 'mercedes@ejemplo.com')
(4, '44444444D', 'Juan', 19, 'juan@ejemplo.com')